var t = [ {
	"id" : 1,
	"text" : "报表分类树",
	"children" : [ {
		"id" : 11,
		"text" : "ERP",
		"children" : [ {
			"id" : 111,
			"text" : "公司级报表",
			"children" : [ {
				"id" : 1111,
				"text" : "公司产量产值完成情况"
			}, {
				"id" : 1112,
				"text" : "产量完成情况表报表"
			}, {
				"id" : 1113,
				"text" : "主要经济指标完成情况(生产)"
			}, {
				"id" : 1114,
				"text" : "主要经济指标完成情况(销售)"
			}, {
				"id" : 1115,
				"text" : "主要经济指标完成情况(消耗)"
			}, {
				"id" : 1116,
				"text" : "主要经济指标完成情况(效益)"
			}, {
				"id" : 1117,
				"text" : "主要经济指标完成情况(排放)"
			} ]
		}, {
			"id" : 112,
			"text" : "厂级报表",
			"children" : [ {
				"id" : 1121,
				"text" : "卷烟成品收发存统计报表"
			}, {
				"id" : 1122,
				"text" : "滤嘴棒成型生产消耗报表"
			}, {
				"id" : 1122,
				"text" : "按品牌系列比对查询表"
			}, {
				"id" : 1122,
				"text" : "主要原辅料消耗统计汇总表"
			}, {
				"id" : 1122,
				"text" : "卷包生产线原辅材料消耗汇总表"
			}, {
				"id" : 1122,
				"text" : "卷包生产线品牌消耗明细表"
			} ]
		} ]
	}, {
		"id" : 12,
		"text" : "一号工程",
		"children" : [ {
			"id" : 121,
			"text" : "产值报表",
			"children" : [ {
				"id" : 1211,
				"text" : "产值日报表"
			}, {
				"id" : 1212,
				"text" : "产值月报表"
			} ]
		}, {
			"id" : 122,
			"text" : "产量报表",
			"children" : [ {
				"id" : 1221,
				"text" : "产量日报表"
			}, {
				"id" : 1221,
				"text" : "产量月报表"
			} ]
		}, {
			"id" : 123,
			"text" : "经济指标报表",
			"children" : [ {
				"id" : 1231,
				"text" : "主要经济指标完成情况(生产)"
			}, {
				"id" : 1231,
				"text" : "主要经济指标完成情况(销售)"
			}, {
				"id" : 1231,
				"text" : "主要经济指标完成情况(消耗)"
			}, {
				"id" : 1231,
				"text" : "主要经济指标完成情况(效益)"
			}, {
				"id" : 1231,
				"text" : "主要经济指标完成情况(排放)"
			} ]
		} ]
	}, {
		"id" : 13,
		"text" : "商业",
		"children" : [ {
			"id" : 131,
			"text" : "销售量",
			"children" : [ {
				"id" : 1311,
				"text" : "销售量日报表"
			}, {
				"id" : 1312,
				"text" : "销售量月报表"
			} ]
		}, {
			"id" : 132,
			"text" : "销售额",
			"children" : [ {
				"id" : 1321,
				"text" : "销售额日报表"
			}, {
				"id" : 1322,
				"text" : "销售额月报表"
			} ]
		} ]
	}, {
		"id" : 14,
		"text" : "工业",
		"children" : [ {
			"id" : 141,
			"text" : "工业产量",
			"children" : [ {
				"id" : 1411,
				"text" : "工业产量日报表"
			}, {
				"id" : 1412,
				"text" : "工业产量月报表"
			} ]
		}, {
			"id" : 142,
			"text" : "工业产值",
			"children" : [ {
				"id" : 1421,
				"text" : "工业产值日报表"
			}, {
				"id" : 1422,
				"text" : "工业产值月报表"
			} ]
		} ]
	}, {
		"id" : 15,
		"text" : "CRM",
		"children" : [ {
			"id" : 151,
			"text" : "预订量",
			"children" : [ {
				"id" : 1511,
				"text" : "卷烟预订量统计报表"
			}, {
				"id" : 1512,
				"text" : "地区预订量统计报表"
			} ]
		}, {
			"id" : 152,
			"text" : "客户分布",
			"children" : [ {
				"id" : 1521,
				"text" : "客户分布情况"
			}, {
				"id" : 1522,
				"text" : "客户预订量"
			} ]
		} ]
	} ]
} ]
